node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 12288
        }
      }
    }
  }
}
node {
  name: "labels_placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Cast/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1519
          }
        }
        string_val: "D:/train_data/image_data/input_data/circle/177samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/906samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/838samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1887samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/66samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/139samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1365samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1301samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1178samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/393samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/446samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1611samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1329samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/633samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1398samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/569samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1091samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/482samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1857samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/423samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/145samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/596samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1180samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/932samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1793samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1614samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/981samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/709samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/931samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/669samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/196samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/182samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/632samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/500samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1030samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/716samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/649samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/664samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/962samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/563samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/94samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1837samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/680samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/711samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/484samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/68samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/479samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1623samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1492samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1525samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1317samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1143samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/256samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/941samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1296samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1394samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1853samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1145samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/270samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1609samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/687samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/214samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/879samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/555samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/628samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/405samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/741samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/146samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/99samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/971samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1416samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1745samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1240samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/625samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1754samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1457samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1683samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1000samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/626samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/21samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/978samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1410samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1553samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/802samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/703samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/426samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1843samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1279samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1288samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/955samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/32samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1088samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1654samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1516samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/419samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1740samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1331samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1672samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1695samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/461samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1743samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/689samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/639samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1841samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/428samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/578samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1765samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/654samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1872samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/872samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/188samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1289samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1217samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/352samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1640samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1503samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/404samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1565samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1515samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/725samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/379samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1286samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/575samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/8samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1418samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/190samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/29samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1822samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1710samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1537samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1850samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1339samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/686samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1452samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1523samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/297samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1669samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/54samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/34samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1155samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/678samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1026samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/170samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/696samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/953samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/173samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/895samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/740samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/441samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/425samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/567samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/880samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1729samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/203samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/900samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1649samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/681samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1062samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/421samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/928samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1653samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1471samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/977samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/413samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1688samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1324samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/222samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/386samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1469samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/964samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1170samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/248samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/50samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1219samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1633samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/164samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/316samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1461samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1274samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1386samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1380samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1120samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1147samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1866samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/144samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1664samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/107samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/73samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/939samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/253samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/212samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1550samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1379samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/105samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/869samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1551samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1103samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1526samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1388samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/20samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1436samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/478samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/287samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1494samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1827samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/106samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1700samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1704samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1303samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/650samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/882samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/531samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/808samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/997samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1085samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1396samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/845samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/562samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/584samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/806samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/769samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/163samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/547samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1067samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/184samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1675samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/814samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/629samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1665samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/251samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1058samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1238samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/522samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1742samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/876samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/460samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1659samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/910samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/892samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1547samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/679samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1713samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1177samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1560samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/768samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1825samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/865samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1509samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1173samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1040samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/280samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1829samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1894samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1617samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1142samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1836samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/266samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/138samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/943samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/533samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/825samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/329samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1873samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/881samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/778samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/793samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1271samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/553samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1507samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1037samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/792samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/637samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/891samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1600samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1342samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1125samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/192samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1298samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1198samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1080samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1357samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1076samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1285samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1146samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1008samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/916samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/444samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1753samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/786samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1867samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/519samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1214samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/0samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1817samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/732samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/934samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/158samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1757samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1358samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/877samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/215samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1528samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1707samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1375samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/328samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1134samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1149samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/830samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1059samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/842samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1230samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/245samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1169samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1216samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1606samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/40samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/53samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/942samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1131samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/823samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1681samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1566samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/382samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1473samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/779samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/705samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/454samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/347samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1610samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1083samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/677samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1511samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1270samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1498samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1508samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/752samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/693samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/770samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/528samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1493samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/462samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1512samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/101samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/380samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1563samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1618samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1561samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1055samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/799samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/738samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/858samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1562samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/790samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1832samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/746samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/843samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/495samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1275samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1582samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1189samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/360samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/926samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1556samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1446samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/319samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1802samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1361samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/435samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/640samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1748samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/710samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/644samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1884samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/874samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1141samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1343samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/734samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1130samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/400samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1384samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/273samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1879samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/90samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1554samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1543samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1442samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1558samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/355samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/511samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/976samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1200samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1433samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1123samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1252samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1069samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1307samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/330samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/954samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/777samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/990samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/661samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1227samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1081samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1034samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/960samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1417samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1202samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1823samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1367samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/526samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/820samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1203samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/157samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/899samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1239samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1350samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/283samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/114samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/123samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/590samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/205samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1479samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1182samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/616samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1157samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/186samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/424samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/387samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/662samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/598samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/965samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1812samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/470samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/51samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1881samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/826samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/26samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/503samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1129samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1731samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1382samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1042samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/95samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/437samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1144samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/730samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1637samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/191samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/140samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1607samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/258samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1406samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/759samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1735samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/490samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1504samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/257samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1431samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1226samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/407samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1794samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1251samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/824samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/62samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/668samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/561samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1094samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1604samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/663samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/980samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/992samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/936samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/623samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1447samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/37samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/764samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1338samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1699samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/318samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1752samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/346samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1191samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/13samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/427samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/973samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1263samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1184samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/235samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1071samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/861samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/410samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/651samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/336samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/538samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1304samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1826samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1580samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1016samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1591samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/221samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/160samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1594samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/314samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1078samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1552samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1601samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1598samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/126samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1114samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1864samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/321samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/364samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1518samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/925samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1023samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1773samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/473samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/282samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/929samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1210samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/909samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1629samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/476samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1236samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/406samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1455samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/254samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/622samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/757samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1391samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1807samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/840samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/119samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/395samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/647samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1549samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/242samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/701samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/260samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1228samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1117samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/415samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/174samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/812samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1064samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1197samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/180samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/514samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/310samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1771samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/773samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/243samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/602samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/372samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/165samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/168samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1801samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1362samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1778samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1400samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1791samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1684samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/648samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1124samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/267samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/60samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1842samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/474samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1755samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/819samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1121samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1185samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/394samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/722samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/229samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/238samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/86samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1574samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/720samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1536samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/731samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1221samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/circle/472samples0.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1084samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1808samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/1116samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/557samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/988samples1.jpg"
        string_val: "D:/train_data/image_data/input_data/rectangle/1587samples2.jpg"
        string_val: "D:/train_data/image_data/input_data/triangle/527samples1.jpg"
